src/cf/Reports/уатСводОНаличииТехникиДляВоенкомата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>уатСводОНаличииТехникиДляВоенкомата</Name>
			<Comment>Свод о наличии техники для военкомата (уат)</Comment>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/уатВыработкаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатВыработкаТС</Name>
			<Comment>Выработка транспортных средств (уат)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>ТС или оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатНаправленияПеревозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыМоделейТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыМоделейТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автотранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвиационныйТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорскойТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатПринадлежностьДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПринадлежностьДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыВодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыКонтрагента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатРегистрационныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатРегистрационныеДокументы</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежностьДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПринадлежностьДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания срока действия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСтатусыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Comment>Кем выдан документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытыеКатегории</Name>
					<Comment>Категория документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКартинка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРегистрационныеДокументыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКатегория</Name>
					<Comment>Помечено на удаление в релизе 1.1.9.1</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Категории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКатегорииДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Открыта</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Reports/уатСводОНаличииТехникиДляВоенкомата/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаКон = НачалоМесяца(ТекущаяДата())-1;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заголовок(Команда)
	ВыводитьЗаголовок = НЕ ВыводитьЗаголовок;
	Элементы.ФормаЗаголовок.Пометка = ВыводитьЗаголовок;
	Сформировать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок = СформироватьОтчет();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Выводит заголовок отчета
//
// Параметры:
//	Нет.
//
&НаСервере
Функция СформироватьЗаголовок(Макет)
	
	// Вывод заголовка, описателя периода и фильтров и заголовка
	ОписаниеПериода = НСтр("en='data on';ru='данные на'") + " " + Строка(Формат(ДатаКон, "ДФ=dd.MM.yyyy"));
	
	ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");
	
	НазваниеОрганизации = Организация.НаименованиеПолное;
	Если ПустаяСтрока(НазваниеОрганизации) Тогда
		НазваниеОрганизации = Организация;
	КонецЕсли;
	
	Если Не ПустаяСтрока(НазваниеОрганизации) Тогда
		НазваниеОрганизации = " " + НСтр("en='in';ru='в'") + " " + НазваниеОрганизации;
	КонецЕсли;
	
	ЗаголовокОтчета.Параметры.ОписаниеПериода = ОписаниеПериода;
	
	ЗаголовокОтчета.Параметры.Заголовок = ЗаголовокОтчета() + НазваниеОрганизации;
	
	Возврат(ЗаголовокОтчета);
	
КонецФункции // СформироватьЗаголовок()

// Функция возвращает текст заголовка отчета
//
&НаСервере
Функция ЗаголовокОтчета()
	Возврат НСтр("en='Set of available technics for military enlistment office';ru='Свод о наличии техники для военкомата'");
КонецФункции // ЗаголовокОтчета()

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//  ДокументРезультат - табличный документ, формируемый отчетом
//
&НаСервере
Функция СформироватьОтчет()
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос(	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК КоличествоТС,
	|	уатТС.ОсновноеСредство КАК ОсновноеСредство,
	|	уатМестонахождениеТССрезПоследних.Колонна КАК Колонна,
	|	уатМестонахождениеТССрезПоследних.Организация КАК Организация,
	|	""Исправен"" КАК ТехническоеСостояние,
	|	уатТС.Ссылка КАК Ссылка,
	|	уатТС.ГосударственныйНомер КАК ГосударственныйНомер,
	|	уатТС.ГаражныйНомер КАК ГаражныйНомер,
	|	уатТС.Модель.ОбъемБака КАК ОбъемБака,
	|	уатТС.ГодВыпуска КАК ГодВыпуска,
	|	уатТС.Модель КАК Модель,
	|	уатТС.ТипТС КАК ТипТС,
	|	уатТС.ТипТС.ВидТС КАК ТипТСУкрупненный,
	|	уатТС.Модель.ОсновноеТопливо КАК ОсновноеТопливо,
	|	уатТС.СобственныйВес КАК МассаБезНагрузки,
	|	уатТС.СобственныйВес + уатТС.Модель.Грузоподъемность КАК МассаПолная,
	|	уатТС.Модель.Код КАК КодМарки,
	|	уатВыработкаТСОбороты.КоличествоОборот КАК КоличествоОборот,
	|	ВЫБОР
	|		КОГДА уатТС.Модель.НаличиеСпидометра
	|			ТОГДА уатВыработкаТСОбороты.КоличествоОборот + уатТС.НачальныйПробег
	|		ИНАЧЕ уатВыработкаТСОбороты.КоличествоОборот / 3600 + уатТС.НачальныйПробег
	|	КОНЕЦ КАК Пробег,
	|	уатТС.ДатаПостановкиНаУчетГИБДД КАК ДатаПостановкиНаУчетГИБДД
	|ИЗ
	|	Справочник.уатТС КАК уатТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ДатаКон, ) КАК уатМестонахождениеТССрезПоследних
	|		ПО (уатМестонахождениеТССрезПоследних.ТС = уатТС.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатВыработкаТС.Обороты(
	|				,
	|				&ДатаКон,
	|				,
	|				НЕ ТС.Модель.НаличиеСпидометра
	|						И ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ВремяВРаботе)
	|					ИЛИ ТС.Модель.НаличиеСпидометра
	|						И ПараметрВыработки = ЗНАЧЕНИЕ(Справочник.уатПараметрыВыработки.ПробегОбщий)) КАК уатВыработкаТСОбороты
	|		ПО (уатВыработкаТСОбороты.ТС = уатТС.Ссылка)
	|ГДЕ
	|	уатМестонахождениеТССрезПоследних.Организация = &Организация
	|	И уатТС.ДатаВыбытия = &ПустаяДата
	|	И (&ОтображатьВсеВидыТС
	|				И (уатТС.Модель.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Автотранспорт)
	|					ИЛИ уатТС.Модель.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Прицеп))
	|			ИЛИ уатТС.Модель.ВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Автотранспорт))");
	
	Запрос.Параметры.Вставить("ДатаКон", КонецДня(ДатаКон));
	Запрос.Параметры.Вставить("Организация", Организация);
	Запрос.Параметры.Вставить("ПустаяДата" , Дата('00010101'));
	Запрос.Параметры.Вставить("ОтображатьВсеВидыТС", РежимОтображения = 1);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	Если ВыводитьЗаголовок Тогда
		Шапка = Макет.ПолучитьОбласть("Заголовок");
		//Шапка.Параметры.НазваниеОрганизации	= уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Организация, ДатаКон),
		//"ПолноеНаименование, ЮридическийАдрес, Телефоны");
		
		// Вывод заголовка отчета
		ОбластьЗаголовка = СформироватьЗаголовок(Макет);
		ВысотаЗаголовка  = ОбластьЗаголовка.ВысотаТаблицы;
		
		ДокументРезультат.Вывести(ОбластьЗаголовка, 1);
	КонецЕсли;
	
	МассивГруппировок = Новый Массив;
	
	//Для Сч=0 По ПостроительОтчета.ИзмеренияСтроки.Количество()-1  Цикл
	//	МассивГруппировок.Добавить(ПостроительОтчета.ИзмеренияСтроки[Сч].Имя);
	//КонецЦикла;
	
	МассивПоказателей = Новый Массив;
	
	МассивПоказателей.Добавить("Колонна");
	МассивПоказателей.Добавить("ГаражныйНомер");
	МассивПоказателей.Добавить("ДатаПостановкиНаУчетГИБДД");
	МассивПоказателей.Добавить("КодМарки");
	МассивПоказателей.Добавить("ТипТС");
	МассивПоказателей.Добавить("Модель");
	МассивПоказателей.Добавить("ГодВыпуска");
	МассивПоказателей.Добавить("ГосударственныйНомер");
	МассивПоказателей.Добавить("Пробег");
	МассивПоказателей.Добавить("ОсновноеТопливо");
	МассивПоказателей.Добавить("ОбъемБака");
	МассивПоказателей.Добавить("МассаПолная");
	МассивПоказателей.Добавить("МассаБезНагрузки");
	МассивПоказателей.Добавить("ТехническоеСостояние");
	
	// Формат показателей
	ФорматПоказателей = Новый Структура;
	
	Для Каждого ИмяПоказателя Из МассивПоказателей Цикл
		Если ИмяПоказателя = "ГодВыпуска" Тогда
			ФорматПоказателей.Вставить(ИмяПоказателя ,"ЧДЦ=0; ЧГ=0; ДФ=dd.MM.yyyy");
		Иначе
			ФорматПоказателей.Вставить(ИмяПоказателя ,"ЧЦ=15; ЧДЦ=2; ДФ=dd.MM.yyyy");
		КонецЕсли;
	КонецЦикла;
	
	// Сдвиг уровня выводимой группировки отчета относительно группировки запроса
	СдвигУровня = 0;
	
	// Флаг сброса сдвига уровня при выводе группировки по счету
	СброситьСдвигУровня = Истина;
	
	ОбластьСтрока					= Макет.ПолучитьОбласть("Строка");
	ОбластьИтогиТипТС				= Макет.ПолучитьОбласть("ИтогиТипТС");
	ОбластьИтогиТипТСУкрупненный	= Макет.ПолучитьОбласть("ИтогиТипТСУкрупненный");
	ОбластьПустаяСтрока				= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОбластьСтрока",					ОбластьСтрока);
	СтруктураПараметров.Вставить("ОбластьИтогиТипТС",				ОбластьИтогиТипТС);
	СтруктураПараметров.Вставить("ОбластьИтогиТипТСУкрупненный",	ОбластьИтогиТипТСУкрупненный);
	СтруктураПараметров.Вставить("ОбластьПустаяСтрока",				ОбластьПустаяСтрока);
	СтруктураПараметров.Вставить("ДокументРезультат",				ДокументРезультат);
	СтруктураПараметров.Вставить("ФорматПоказателей",				ФорматПоказателей);
	СтруктураПараметров.Вставить("МассивПоказателей",				МассивПоказателей);
	
	ЗаголовокОтчета = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ДокументРезультат.Вывести(ЗаголовокОтчета, 1);
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	
	ВывестиСтроки(РезультатЗапроса, СтруктураПараметров);
	
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
		
	// Заполним общую расшифровку:
	СтруктураНастроекОтчета = Новый Структура;
	
	СтруктураНастроекОтчета.Вставить("ДатаОтчета", ДатаКон);
	СтруктураНастроекОтчета.Вставить("ПоказыватьЗаголовок", ВыводитьЗаголовок);
	
	ДокументРезультат.Область(1,1).Расшифровка = СтруктураНастроекОтчета;
	
	// Зафиксируем заголовок отчета
	Если ВыводитьЗаголовок Тогда
		ДокументРезультат.ФиксацияСверху = 5;
	Иначе
		ДокументРезультат.ФиксацияСверху = 1;
	КонецЕсли;
	
	// Первую колонку не печатаем
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
	
	// Ориентация страницы
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСлева = 0;
	ДокументРезультат.ПолеСправа = 0;
		
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = "СписокТехникиВРазрезеМоделейИТипов_Вар1";
	
	Возврат ДокументРезультат;
КонецФункции // СформироватьОтчет()

// Выводит показатели группировки
//
// Параметры:
//	Выборка - выборка
//	ЭтоПерваяСтрока - признак вывода отступов перед субконто
//
&НаСервере
Процедура ВывестиПоказатели(Выборка, СтруктураПараметров)
	
	ДокументРезультат = СтруктураПараметров.ДокументРезультат;
	
	Если Выборка.Группировка() = "ТипТСУкрупненный" Тогда
		Область = СтруктураПараметров.ОбластьИтогиТипТСУкрупненный;
		Область.Параметры.ТипТСУкрупненный	= ВРег(Выборка.ТипТСУкрупненный);
		Область.Параметры.КоличествоТС		= Выборка.КоличествоТС;
		
	ИначеЕсли Выборка.Группировка() = "ТипТС" Тогда
		Область = СтруктураПараметров.ОбластьИтогиТипТС;
		Область.Параметры.ТипТС			= Выборка.ТипТС;
		Область.Параметры.КоличествоТС	= Выборка.КоличествоТС;
		
	Иначе
		Область = СтруктураПараметров.ОбластьСтрока;
		Область.Параметры.РасшифровкаТС = Выборка.Ссылка;

		Для Каждого ИмяПоказателя Из СтруктураПараметров.МассивПоказателей Цикл
			ФорматПоказателя = "";
			СтруктураПараметров.ФорматПоказателей.Свойство(ИмяПоказателя, ФорматПоказателя);
			Область.Параметры[ИмяПоказателя]  = СокрЛП(Формат(Выборка[ИмяПоказателя], ФорматПоказателя));
		КонецЦикла;

		ЗапросПТС = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	уатДокументыТС.Серия КАК Серия,
		|	уатДокументыТС.Номер КАК Номер
		|ИЗ
		|	Справочник.уатРегистрационныеДокументы КАК уатДокументыТС
		|ГДЕ
		|	уатДокументыТС.ВладелецДокументов = &ТС
		|	И уатДокументыТС.ВидДокумента = ЗНАЧЕНИЕ(Справочник.уатВидыДокументов.ПТС)
		|	И НЕ уатДокументыТС.Статус = ЗНАЧЕНИЕ(Перечисление.уатСтатусыдействия.НеДействует)
		|	И уатДокументыТС.ПринадлежностьДокументов = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьДокументов.ДокументыТС)
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатДокументыТС.ДатаВыдачи УБЫВ,
		|	уатДокументыТС.ДатаОкончания УБЫВ");
		ЗапросПТС.УстановитьПараметр("ТС", Выборка.Ссылка);
		ВыборкаПТС = ЗапросПТС.Выполнить().Выбрать();
		Если ВыборкаПТС.Следующий() Тогда
			Область.Параметры.ПТССерия = ВыборкаПТС.Серия;
			Область.Параметры.ПТСНомер = ВыборкаПТС.Номер;
		Иначе
			Область.Параметры.ПТССерия = Неопределено;
			Область.Параметры.ПТСНомер = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Область.Область("R1C2").Отступ = Макс(Выборка.Уровень() - 1, 0);
	
	ДокументРезультат.Вывести(Область, Выборка.Уровень());
	
КонецПроцедуры // ВывестиПоказатели()

// Выводит строки
//
// Параметры:
//	Выборка - выборка
//
&НаСервере
Процедура ВывестиСтроки(Выборка, СтруктураПараметров)
	
	ДокументРезультат = СтруктураПараметров.ДокументРезультат;
	Область = СтруктураПараметров.ОбластьСтрока;
	
	Пока Выборка.Следующий() Цикл
		ВывестиПоказатели(Выборка, СтруктураПараметров); 	
	КонецЦикла;
	
КонецПроцедуры // ВывестиПоказатели()

#КонецОбласти
